src/CF/InformationRegisters/НоменклатураЧастогоСпроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураЧастогоСпроса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/ЗначенияНаДругихЯзыках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНаДругихЯзыках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектБазыДанных</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихКодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихКодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Enums/ОбъектыДляДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ОбъектыДляДополнительныхРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаВыполненияРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаДвиженияДенег</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаИнвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаКорректировкаИВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаПеремещенияТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаПланПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаПоступлениеТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаРасходТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументаУстановкаЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляЗаметокИНапоминаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляПрикрепленныхИзображений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаВидыЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаКлиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаНоменклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаПартииПриобретения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаПоставщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаПроизводители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаРегионы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаСклады</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаСотрудники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаСтатьиДвиженияДенег</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСправочникаХранилищаДенег</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыйМинимальныйОстатокТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланкаКоличестваДляЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтслеживатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьУказаниеБезСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Зависимая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОтБазовойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаОтБазовогоВидаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулыОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВЦелыхЕдиницах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиДляРасчетаЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьТолькоВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/CommonModules/ОбщийМодульПовтор/Ext/Module.bsl
//sza140125-0311 
//sza131003-1330 : 

Функция   ПолучитьТекстНаЯзыке(Знач ТекстНаРусском, Знач КонкретныйЯзык = Неопределено) Экспорт 	
	Возврат ОбщийМодульТекстСервер.ПолучитьТекстНаЯзыке(ТекстНаРусском, КонкретныйЯзык);	
КонецФункции //ПолучитьТекстНаЯзыке

&НаСервере
Функция   ТоварНеУчитываетсяПоКоличеству(Знач Номенклатура) Экспорт
//%16.8	
	Если Номенклатура.НеОтслеживатьОстаток 
		или Номенклатура = Справочники.Номенклатура.ТоварНаСумму
		или Номенклатура = Справочники.Номенклатура.УслугиНаСумму Тогда
		
		возврат истина;
	иначе
		возврат ложь;
	КонецЕсли;
	
КонецФункции //ТоварНеУчитываетсяПоКоличеству

Функция   ЭтоНабор(Знач Номенклатура) Экспорт
	
	#Если Клиент Тогда
		Возврат ОбщийМодульСервер.ПолучитьЗначениеПраметраСеанса("ИспользованиеНаборовТоваровПС") И ОбщийМодульТоварСервер.ЭтоНабор(Номенклатура);
	#КонецЕсли
	
	#Если НЕ Клиент Тогда
		Возврат ПараметрыСеанса.ИспользованиеНаборовТоваровПС И Номенклатура.ЭтоНабор;		
	#КонецЕсли	
	
КонецФункции //ЭтоНабор

Функция   ПолучитьТекущийКурс(Знач Валюта = Неопределено, Знач Дата = Неопределено) Экспорт  	
	Возврат ОбщийМодульСервер.ПолучитьТекущийКурс(Валюта, Дата);	
КонецФункции //ПолучитьТекущийКурс

Функция   ПолучитьПараметрСеанса(Знач ИмяПараметра) Экспорт	
	Возврат ОбщийМодульСервер.ПолучитьЗначениеПраметраСеанса(ИмяПараметра);	
КонецФункции //получитьПараметрСеанса

&НаСервере
Функция   ВыяснитьПодходящийВидОбъекта(Знач ИсточникМетаданные, Знач режим) Экспорт
	
	если режим = 1 тогда
		ВидОбъекта = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(Метаданные.регистрынакопления[ИсточникМетаданные]);	
	иначеесли режим = 2 тогда 
		ВидОбъекта = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(Метаданные.справочники[ИсточникМетаданные]);	
	иначеесли режим = 3 тогда 
		ВидОбъекта = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(Метаданные.регистрысведений[ИсточникМетаданные]);	
	КонецЕсли;
	
	Возврат  НЕ ВидОбъекта = Неопределено 
	и ВидОбъекта.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать
	и ПараметрыСеанса.ИспользоватьЖурналированиеСобытий;
	
КонецФункции //ВыяснитьПодходящийВидОбъекта

&НаСервере
Функция   ПолучитьСписокНоменклатурыБыстрогоСпроса(Знач ВернутьСписок = истина) Экспорт
	возврат ОбщийМодульТоварСервер.ПолучитьСписокНоменклатурыБыстрогоСпроса(ВернутьСписок);
КонецФункции //ПолучитьСписокНоменклатурыБыстрогоСпроса

&НаСервере
Функция   ПолучитьНоменклатуруБыстрогоСпроса(Знач Позиция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 НоменклатураЧастогоСпроса.Номенклатура
	|ИЗ РегистрСведений.НоменклатураЧастогоСпроса КАК НоменклатураЧастогоСпроса
	|ГДЕ НоменклатураЧастогоСпроса.Позиция = &Позиция";
	
	Запрос.УстановитьПараметр("Позиция", Позиция);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.Номенклатура.ПустаяСсылка();	
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Номенклатура;	
		
	КонецЕсли;
	
КонецФункции //ПолучитьНоменклатуруБыстрогоСпроса

&НаСервере
Функция   ПлатнаяВерсия() Экспорт
	Возврат ОбщийМодульСервер.ПлатнаяВерсия();
КонецФункции

&НаСервере
Функция   РегистрационныйКод() Экспорт
	Возврат Метаданные.Комментарий;
КонецФункции //РегистрационныйКод

Функция   получитьЗначениеНастройкиИлиКонстанты(Знач ИмяКонстанты, Знач ТолькоКонстанта = Ложь) Экспорт
	Возврат ОбщийМодульСервисСервер.получитьЗначениеНастройкиИлиКонстантыНаСервере(ИмяКонстанты, ТолькоКонстанта);
КонецФункции //получитьЗначениеНастройкиИлиКонстанты

Функция   ТоварВедетсяПоСериям(Номенклатура) Экспорт
	
	Возврат ОбщийМодульСервисСервер.ПолучитьЗначениеРеквизита(Номенклатура, "СерийныйУчет");
	
КонецФункции //ТоварВедетсяПоСериям

Функция   ТоварВедетсяПоСериямИСерияОбязательна(Знач Номенклатура) Экспорт
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Номенклатура)
		и Номенклатура.СерийныйУчет
		И Номенклатура.ЗапретитьУказаниеБезСерии Тогда
		
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //ТоварВедетсяПоСериямИСерияОбязательна

&НаСервере
Функция   ОпределитьПользователя() Экспорт
	Возврат ОбщийМодульСерверПривилегия.ОпределитьПользователя();
КонецФункции

&НаСервере
функция   ЗапросВЦ() Экспорт
	
	ЗапросВЦР = Новый Запрос;
	ЗапросВЦР.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ВидыЦен.Ссылка ИЗ Справочник.ВидыЦен КАК ВидыЦен ГДЕ ВидыЦен.ПометкаУдаления = ЛОЖЬ И ВидыЦен.Зависимая = ЛОЖЬ И ВидыЦен.ВалютаЦены = &ОсновнаяВалюта";
	
	ЗапросВЦР.УстановитьПараметр("ОсновнаяВалюта", ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта"));
	
	Возврат ЗапросВЦР.Выполнить();
	
КонецФункции

&НаСервере
Функция   ЗначениеПредопределенного(Знач ТекстДляЗначения) Экспорт
	
	Результат = Неопределено;
	
	Выполнить(" Результат = " + ТекстДляЗначения + ";");
	
	Возврат Результат;
	
КонецФункции //ЗначениеПредопределенного

&НаСервере
Функция   ПолучитьНоменклатурнуюГруппуПоНаименованию(Знач наименование, Знач НеСоздавать = Ложь) Экспорт
	Возврат ОбщийМодульТоварСервер.ПолучитьНоменклатурнуюГруппуПоНаименованию(наименование, НеСоздавать);
КонецФункции //ПолучитьНоменклатурнуюГруппуПоНаименованию

&НаСервере
Функция   ТекущийЯзыкРусский() Экспорт
	Возврат НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы) ИЛИ ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы = Справочники.Языки.Русский;	
КонецФункции //ТекущийЯзыкРусский

&НаСервере
Функция   ПолучитьПредставлениеНаЯзыке(Знач Данные, Знач ПолеЗначения = "Наименование", Знач ОтказатьсяПриОтсутствии = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ЗначенияНаДругихЯзыках.НаЯзыке
	|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
	|ГДЕ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных
	|	И ЗначенияНаДругихЯзыках.Поле = &Поле
	|	И ЗначенияНаДругихЯзыках.Язык = &Язык";
	
	Запрос.УстановитьПараметр("ОбъектБазыДанных", Данные);
	Запрос.УстановитьПараметр("Поле", ПолеЗначения);
	Запрос.УстановитьПараметр("Язык", ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийЯзыкИнтерфейсаПрограммы"));
	
	РезультатЗапроса = Запрос.Выполнить();
	если не РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;
	иначеЕсли НЕ ОтказатьсяПриОтсутствии Тогда
		НаЯзыке = Данные[ПолеЗначения];
	Иначе
		НаЯзыке = Неопределено;
	КонецЕсли;
	
	Возврат НаЯзыке;
	
КонецФункции //ПолучитьПредставлениеНаЯзыке

Функция   СпецСправочник(Знач ТипСправочника) Экспорт
	
	ТипСправочника = Врег(ТипСправочника);
	Возврат ТипСправочника = "НОМЕНКЛАТУРА"
		ИЛИ ТипСправочника = "КЛИЕНТЫ" 
		ИЛИ ТипСправочника = "ПОСТАВЩИКИ" 
		ИЛИ ТипСправочника = "ОРГАНИЗАЦИИ" 
		ИЛИ ТипСправочника = "СЕРИИНОМЕНКЛАТУРЫ" 
		ИЛИ ТипСправочника = "СОТРУДНИКИ";
	
КонецФункции //СпецСправочник

&НаСервере
Функция   ПолучитьШтрихКодНоменклатурыИлиСерии(Знач Ссылка, Знач ЭтоСерия = Ложь) Экспорт
	
	результат = "";
	если не этосерия тогда
		результат = Сокрлп(ссылка.ОсновнойШтрихКод);
		
		Если результат = "" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
			|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
			|ГДЕ ШтрихКоды.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("Номенклатура", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			если не РезультатЗапроса.Пустой() тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				результат = ВыборкаДетальныеЗаписи.ШтрихКод;
			конецесли;
		КонецЕсли;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
		|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ ШтрихКоды.СерияНоменклатуры = &СерияНоменклатуры";
		
		Запрос.УстановитьПараметр("СерияНоменклатуры", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			результат = ВыборкаДетальныеЗаписи.ШтрихКод;
		конецесли;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции //ПолучитьШтрихКодНоменклатурыИлиСерии

Функция   ПолучитьТекстЗапросаПоискаСпецСправочника(Знач ТипСправочника) Экспорт
			
	Результат = "";
	
	ТипСправочника = Врег(ТипСправочника);
	Если ТипСправочника = "НОМЕНКЛАТУРА"
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		и НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода") Тогда
		
		Результат = "НШК";
		
	ИначеЕсли (ТипСправочника = "КЛИЕНТЫ" 
		ИЛИ ТипСправочника = "ПОСТАВЩИКИ" 
		ИЛИ ТипСправочника = "ОРГАНИЗАЦИИ" 
		ИЛИ ТипСправочника = "СОТРУДНИКИ")
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ЗапретитьИспользоватьОдинаковыеКодыИНН") Тогда
		
		Результат = "ВЫБРАТЬ ПЕРВЫЕ 1 С.Ссылка ИЗ Справочник." + ТипСправочника + " КАК С ГДЕ С.ОКПО = &СпецКод ";
		
	ИначеЕсли ТипСправочника = "СЕРИИНОМЕНКЛАТУРЫ"
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		и НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода") Тогда
		
		Результат = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.СерияНоменклатуры Как Ссылка
		 |ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		 |ГДЕ ШтрихКоды.ШтрихКод = &СпецКод";
		
	Иначе
		Результат = "ВЫБРАТЬ ПЕРВЫЕ 1 С.Ссылка ИЗ Справочник." + ТипСправочника + " КАК С ГДЕ С.Наименование = &СпецКод ";// И С.Код = &ЗначениеКод";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция   ПолучитьОсновноеИзображениеОбъекта(Знач СвязанныйОбъект) Экспорт	
	Возврат ОбщийМодульСервер.ПолучитьОсновноеИзображениеОбъекта(СвязанныйОбъект);	
КонецФункции //ПолучитьОсновноеИзображениеОбъекта

Функция   ВычислитьИмяФормы(Знач ФормаСобытияТ) Экспорт
	
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаЭлемента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка"));
		ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаЗаписи", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка"));
		ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаСписка", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список"));
		ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаОтчета", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Окно отчета"));
		ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаСпискаСОтборомПоГруппе", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Форма с отбором по группе"));
		ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "ОбщаяФорма.НастройкиБазыДанных", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Форма настроек"));
		ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, ".", " ");
	
	Возврат ФормаСобытияТ;
	
КонецФункции //ВычислитьИмяФормы

Функция   ПолучитьПустоеЗначениеДополнительногоРеквизита(Знач ТипДополнительногоРеквизита) Экспорт
	Возврат ОбщийМодульСервер.ПолучитьПустоеЗначениеДополнительногоРеквизита(ТипДополнительногоРеквизита);
КонецФункции

Функция   ПолучитьТипДополнительногоРеквизита(Знач ТипОбъектаДляДополнительныхРеквизитов) Экспорт
	Возврат ОбщийМодульСервер.ПолучитьТипДополнительногоРеквизита(ТипОбъектаДляДополнительныхРеквизитов);
КонецФункции

&НаСервере
Функция   ПолучитьИмяДополнительногоРеквизита(Знач ОбъектВладелец) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоРеквизитДляОбъекта", Перечисления.ОбъектыДляДополнительныхРеквизитов.ПустаяСсылка()) ;
	ТипЗнчОбъектВладелец = ТипЗнч(ОбъектВладелец);
	Результат.Вставить("НаименованиеОбъектаВладельца", ТипЗнчОбъектВладелец);
	
	Если ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ВидыЦен") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаВидыЦен ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Договора") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаДоговора ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ЗаметкиИНапоминания") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляЗаметокИНапоминаний;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Изображения") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляПрикрепленныхИзображений;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Клиенты") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаКлиенты;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Номенклатура") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаНоменклатура ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Организации") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаОрганизации;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ПартииПриобретения") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПартииПриобретения ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Поставщики") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПоставщики ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Производители") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПроизводители ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Регионы") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаРегионы ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Склады") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСклады ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Сотрудники") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСотрудники ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.СредстваПредприятия") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСредств;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.СтатьиДвиженияДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСтатьиДвиженияДенег ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаХранилищаДенег ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ДвиженияДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаДвиженияДенег;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.Инвентаризации") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаИнвентаризация;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаКорректировкаИВводОстатков;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПеремещенияТовара") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПеремещенияТоваров;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПланыПродаж") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПланПродаж;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПоступленияТовара") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПоступлениеТовара;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.РасходыТовара") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаРасходТовара;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ВыполнениеРабот") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаВыполненияРабот;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.УстановкиЦен") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаУстановкаЦен;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьИмяДополнительногоРеквизита

Функция   ПолучитьКрасивоеНаименованиеОбъекта(Знач НаименованиеОбъекта) Экспорт
	
	Наименование = СтрЗаменить(НаименованиеОбъекта, "СправочникСсылка.", "");
	Наименование = СтрЗаменить(Наименование, "ДокументСсылка.", "");
	с = стрдлина(Наименование);
	сч = 1;
	Наименование2 = Лев(Наименование, 1);
	пока сч < с цикл
		сч = сч + 1;		
		СимволСтроки = Сред(Наименование, сч, 1);
		Если СимволСтроки = Врег(СимволСтроки) Тогда
			Наименование2 = Наименование2 + " " + НРег(СимволСтроки);
		Иначе
			Наименование2 = Наименование2 + СимволСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Наименование = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(Наименование2);
	
	Возврат Наименование;
	
КонецФункции //ПолучитьКрасивоеНаименованиеОбъекта
